experiments/moviereview_4node/expected_results/qps3200/wrk_warmup.log
Running 30s test @ http://ip-172-31-4-87.us-east-2.compute.internal:8080
  4 threads and 96 connections
  Thread calibration: mean lat.: 21.067ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 17.390ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 21.028ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 17.224ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.23ms    1.80ms 210.18ms   94.78%
    Req/Sec   825.89    132.81     1.33k    67.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.07ms
 75.000%    6.82ms
 90.000%    7.59ms
 99.000%    8.91ms
 99.900%   12.65ms
 99.990%   61.79ms
 99.999%  187.26ms
100.000%  210.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.981     0.000000            1         1.00
       5.031     0.100000         6379         1.11
       5.343     0.200000        12740         1.25
       5.595     0.300000        19144         1.43
       5.835     0.400000        25540         1.67
       6.071     0.500000        31864         2.00
       6.199     0.550000        35061         2.22
       6.331     0.600000        38175         2.50
       6.475     0.650000        41411         2.86
       6.631     0.700000        44568         3.33
       6.815     0.750000        47734         4.00
       6.915     0.775000        49295         4.44
       7.031     0.800000        50892         5.00
       7.155     0.825000        52479         5.71
       7.287     0.850000        54076         6.67
       7.435     0.875000        55669         8.00
       7.515     0.887500        56484         8.89
       7.595     0.900000        57253        10.00
       7.683     0.912500        58046        11.43
       7.787     0.925000        58866        13.33
       7.891     0.937500        59635        16.00
       7.943     0.943750        60035        17.78
       8.011     0.950000        60455        20.00
       8.071     0.956250        60834        22.86
       8.151     0.962500        61233        26.67
       8.239     0.968750        61622        32.00
       8.287     0.971875        61822        35.56
       8.343     0.975000        62016        40.00
       8.415     0.978125        62235        45.71
       8.487     0.981250        62414        53.33
       8.591     0.984375        62617        64.00
       8.655     0.985938        62713        71.11
       8.735     0.987500        62812        80.00
       8.839     0.989062        62913        91.43
       8.951     0.990625        63011       106.67
       9.135     0.992188        63112       128.00
       9.247     0.992969        63161       142.22
       9.383     0.993750        63208       160.00
       9.551     0.994531        63258       182.86
       9.791     0.995313        63308       213.33
      10.031     0.996094        63357       256.00
      10.231     0.996484        63382       284.44
      10.415     0.996875        63407       320.00
      10.679     0.997266        63432       365.71
      10.847     0.997656        63456       426.67
      11.223     0.998047        63481       512.00
      11.343     0.998242        63494       568.89
      11.639     0.998437        63507       640.00
      11.943     0.998633        63520       731.43
      12.311     0.998828        63531       853.33
      12.751     0.999023        63543      1024.00
      13.079     0.999121        63550      1137.78
      13.647     0.999219        63556      1280.00
      13.823     0.999316        63562      1462.86
      14.359     0.999414        63568      1706.67
      15.695     0.999512        63574      2048.00
      16.143     0.999561        63579      2275.56
      16.575     0.999609        63581      2560.00
      16.815     0.999658        63584      2925.71
      16.911     0.999707        63587      3413.33
      17.263     0.999756        63590      4096.00
      18.911     0.999780        63592      4551.11
      19.071     0.999805        63593      5120.00
      19.887     0.999829        63595      5851.43
      20.271     0.999854        63596      6826.67
      37.791     0.999878        63598      8192.00
      61.791     0.999890        63599      9102.22
      61.791     0.999902        63599     10240.00
      86.975     0.999915        63600     11702.86
     112.447     0.999927        63601     13653.33
     137.471     0.999939        63602     16384.00
     137.471     0.999945        63602     18204.44
     137.471     0.999951        63602     20480.00
     162.559     0.999957        63603     23405.71
     162.559     0.999963        63603     27306.67
     187.263     0.999969        63604     32768.00
     187.263     0.999973        63604     36408.89
     187.263     0.999976        63604     40960.00
     187.263     0.999979        63604     46811.43
     187.263     0.999982        63604     54613.33
     210.303     0.999985        63605     65536.00
     210.303     1.000000        63605          inf
#[Mean    =        6.230, StdDeviation   =        1.800]
#[Max     =      210.176, Total count    =        63605]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    5.24ms
 75.000%    5.88ms
 90.000%    6.52ms
 99.000%    7.75ms
 99.900%   11.37ms
 99.990%   18.22ms
 99.999%   23.26ms
100.000%  210.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.693     0.000000            1         1.00
       4.499     0.100000         6406         1.11
       4.695     0.200000        12841         1.25
       4.875     0.300000        19180         1.43
       5.051     0.400000        25528         1.67
       5.239     0.500000        31866         2.00
       5.343     0.550000        35018         2.22
       5.451     0.600000        38164         2.50
       5.583     0.650000        41431         2.86
       5.723     0.700000        44564         3.33
       5.883     0.750000        47762         4.00
       5.963     0.775000        49303         4.44
       6.055     0.800000        50893         5.00
       6.155     0.825000        52492         5.71
       6.263     0.850000        54073         6.67
       6.387     0.875000        55702         8.00
       6.451     0.887500        56471         8.89
       6.519     0.900000        57246        10.00
       6.599     0.912500        58074        11.43
       6.679     0.925000        58855        13.33
       6.771     0.937500        59655        16.00
       6.827     0.943750        60049        17.78
       6.887     0.950000        60436        20.00
       6.951     0.956250        60843        22.86
       7.019     0.962500        61224        26.67
       7.111     0.968750        61628        32.00
       7.159     0.971875        61819        35.56
       7.219     0.975000        62026        40.00
       7.283     0.978125        62223        45.71
       7.359     0.981250        62417        53.33
       7.459     0.984375        62618        64.00
       7.515     0.985938        62716        71.11
       7.587     0.987500        62812        80.00
       7.675     0.989062        62911        91.43
       7.803     0.990625        63009       106.67
       7.951     0.992188        63109       128.00
       8.075     0.992969        63160       142.22
       8.215     0.993750        63213       160.00
       8.351     0.994531        63260       182.86
       8.559     0.995313        63307       213.33
       8.823     0.996094        63358       256.00
       9.023     0.996484        63382       284.44
       9.183     0.996875        63407       320.00
       9.399     0.997266        63433       365.71
       9.615     0.997656        63457       426.67
       9.823     0.998047        63481       512.00
      10.071     0.998242        63494       568.89
      10.415     0.998437        63506       640.00
      10.711     0.998633        63519       731.43
      11.015     0.998828        63531       853.33
      11.471     0.999023        63543      1024.00
      11.743     0.999121        63550      1137.78
      12.015     0.999219        63556      1280.00
      12.631     0.999316        63562      1462.86
      12.767     0.999414        63568      1706.67
      13.271     0.999512        63574      2048.00
      14.199     0.999561        63578      2275.56
      14.375     0.999609        63581      2560.00
      14.911     0.999658        63584      2925.71
      15.023     0.999707        63587      3413.33
      15.599     0.999756        63590      4096.00
      15.671     0.999780        63592      4551.11
      15.783     0.999805        63593      5120.00
      16.055     0.999829        63595      5851.43
      16.079     0.999854        63596      6826.67
      18.159     0.999878        63598      8192.00
      18.223     0.999890        63599      9102.22
      18.223     0.999902        63599     10240.00
      18.399     0.999915        63600     11702.86
      18.543     0.999927        63601     13653.33
      19.151     0.999939        63602     16384.00
      19.151     0.999945        63602     18204.44
      19.151     0.999951        63602     20480.00
      19.375     0.999957        63603     23405.71
      19.375     0.999963        63603     27306.67
      23.263     0.999969        63604     32768.00
      23.263     0.999973        63604     36408.89
      23.263     0.999976        63604     40960.00
      23.263     0.999979        63604     46811.43
      23.263     0.999982        63604     54613.33
     210.175     0.999985        63605     65536.00
     210.175     1.000000        63605          inf
#[Mean    =        5.406, StdDeviation   =        1.184]
#[Max     =      210.048, Total count    =        63605]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  95837 requests in 30.00s, 16.82MB read
  Non-2xx or 3xx responses: 10
Requests/sec:   3194.33
Transfer/sec:    574.04KB